/* Function(s) for dumping resources from NE files */

/* General TODO: add more sanity checks. In particular all of the times that
 * only one structure supposedly exists, we should check if the length/key/whatever
 * doesn't match anything and print an error if it doesn't. */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "semblance.h"
#include "ne.h"

#pragma pack(1)

struct header_bitmap_info {
    dword biSize;           /* 00 */
    dword biWidth;          /* 04 */
    dword biHeight;         /* 08 */
    word  biPlanes;         /* 0c */
    word  biBitCount;       /* 0e */
    dword biCompression;    /* 10 */
    dword biSizeImage;      /* 14 */
    dword biXPelsPerMeter;  /* 18 */
    dword biYPelsPerMeter;  /* 1c */
    dword biClrUsed;        /* 20 */
    dword biClrImportant;   /* 24 */
};

STATIC_ASSERT(sizeof(struct header_bitmap_info) == 0x28);

static void print_string_resource(long ptr){
    char length;
    fseek(f, ptr, SEEK_SET);
    putchar('"');
    length = read_byte();
    while (length--)
        putchar(read_byte());
    putchar('"');
}

/* length-indexed */
static void print_escaped_string(long length){
    putchar('"');
    while (length--){
        char c = read_byte();
        if (c == '\t')
            printf("\\t");
        else if (c == '\n')
            printf("\\n");
        else if (c == '\r')
            printf("\\r");
        else if (c == '"')
            printf("\\\"");
        else if (c == '\\')
            printf("\\\\");
        else if (c >= ' ' && c <= '~')
            putchar(c);
        else
            printf("\\x%02hhx", c);
    }
    putchar('"');
}

/* null-terminated */
static void print_escaped_string0(void){
    char c;
    putchar('"');
    while ((c = read_byte())){
