/*
 * Function(s) for dumping resources from NE files
 *
 * Copyright 2017-2020 Zebediah Figura
 *
 * This file is part of Semblance.
 *
 * Semblance is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * Semblance is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with Semblance; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301, USA
 */

#include <ctype.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "semblance.h"
#include "ne.h"

#pragma pack(1)

struct header_bitmap_info {
    dword biSize;           /* 00 */
    dword biWidth;          /* 04 */
    dword biHeight;         /* 08 */
    word  biPlanes;         /* 0c */
    word  biBitCount;       /* 0e */
    dword biCompression;    /* 10 */
    dword biSizeImage;      /* 14 */
    dword biXPelsPerMeter;  /* 18 */
    dword biYPelsPerMeter;  /* 1c */
    dword biClrUsed;        /* 20 */
    dword biClrImportant;   /* 24 */
};

STATIC_ASSERT(sizeof(struct header_bitmap_info) == 0x28);

static char *dup_string_resource(off_t offset)
{
    byte length = read_byte(offset);
    char *ret = malloc(length + 1);
    memcpy(ret, read_data(offset + 1), length);
    ret[length] = 0;
    return ret;
}

/* length-indexed; returns  */
static void print_escaped_string(off_t offset, long length){
    putchar('"');
    while (length--){
        char c = read_byte(offset++);
        if (c == '\t')
            printf("\\t");
        else if (c == '\n')
            printf("\\n");
        else if (c == '\r')
            printf("\\r");
        else if (c == '"')
            printf("\\\"");
        else if (c == '\\')
            printf("\\\\");
        else if (c >= ' ' && c <= '~')
            putchar(c);
        else
            printf("\\x%02hhx", c);
    }
    putchar('"');
}

/* null-terminated; returns the end of the string */
static off_t print_escaped_string0(off_t offset)
{
    char c;
    putchar('"');
    while ((c = read_byte(offset++))){
        if (c == '\t')
            printf("\\t");
        else if (c == '\n')
            printf("\\n");
        else if (c == '\r')
            printf("\\r");
        else if (c == '"')
            printf("\\\"");
        else if (c == '\\')
            printf("\\\\");
        else if (c >= ' ' && c <= '~')
            putchar(c);
        else
            printf("\\x%02hhx", c);
    }
    putchar('"');
    return offset;
}

static void print_timestamp(dword high, dword low){
    /* TODO */
};

const char *const rsrc_types[] = {
    0,
    "Cursor",            /* 1 */
    "Bitmap",            /* 2 */
    "Icon",              /* 3 */
    "Menu",              /* 4 */
    "Dialog box",        /* 5 */
    "String",            /* 6 */
    "Font directory",    /* 7 */
    "Font component",    /* 8 */
    "Accelerator table", /* 9 */
    "Resource data",     /* a */
    "Message table",     /* b */    /* fixme: error table? */
    "Cursor directory",  /* c */
    0,
    "Icon directory",    /* e */
    "Name table",        /* f */
    "Version",           /* 10 */
    0,                              /* fixme: RT_DLGINCLUDE? */
    0
};
const size_t rsrc_types_count = sizeof(rsrc_types)/sizeof(rsrc_types[0]);

static const char *const rsrc_bmp_compression[] = {
    "none",                     /* 0 */
    "RLE (8 bpp)",              /* 1 */
    "RLE (4 bpp)",              /* 2 */
    "RGB bit field masks",      /* 3 */
    "JPEG", /* shouldn't occur?    4 */
    "PNG", /* shouldn't occur?     5 */
    "RGBA bit field masks",     /* 6 */
    0,
    0,
    0,
    0,
    "none (CMYK)",              /* 11 */
    "RLE (8 bpp, CMYK)",        /* 12 */
    "RLE (4 bpp, CMYK)",        /* 13 */
    0
};

static void print_rsrc_flags(word flags){
    if (flags & 0x0010)
        printf(", moveable");
    if (flags & 0x0020)
        printf(", shareable");
    if (flags & 0x0040)
        printf(", preloaded");
    if (flags & 0xff8f)
        printf(", (unknown flags 0x%04x)", flags & 0xff8f);
}

/* There are a lot of styles here and most of them would require longer
 * descriptions, so we're just going to use the C names.
 * Not all of these are dialog box-related, but I'm not going to try to
 * sort through them. */

static const char *const rsrc_dialog_style[] = {
    "DS_ABSALIGN",      /* 00000001 */
    "DS_SYSMODAL",      /* 00000002 */
    "DS_3DLOOK",        /* 00000004 */
    "DS_FIXEDSYS",      /* 00000008 */
    "DS_NOFAILCREATE",  /* 00000010 */
    "DS_LOCALEDIT",     /* 00000020 */
    "DS_SETFONT",       /* 00000040 */
    "DS_MODALFRAME",    /* 00000080 */
    "DS_NOIDLEMSG",     /* 00000100 */
    "DS_SETFOREGROUND", /* 00000200 */
    "DS_CONTROL",       /* 00000400 */
    "DS_CENTER",        /* 00000800 */
    "DS_CENTERMOUSE",   /* 00001000 */
    "DS_CONTEXTHELP",   /* 00002000 */
    "(unrecognized flag 0x00004000)",
    "DS_USEPIXELS",     /* 00008000 */
    "WS_TABSTOP",       /* 00010000 */
    "WS_GROUP",         /* 00020000 */
    "WS_THICKFRAME",    /* 00040000 */
    "WS_SYSMENU",       /* 00080000 */
    "WS_HSCROLL",       /* 00100000 */
    "WS_VSCROLL",       /* 00200000 */
    "WS_DLGFRAME",      /* 00400000 */
    "WS_BORDER",        /* 00800000 */
    "WS_MAXIMIZE",      /* 01000000 */
    "WS_CLIPCHILDREN",  /* 02000000 */
    "WS_CLIPSIBLINGS",  /* 04000000 */
    "WS_DISABLED",      /* 08000000 */
    "WS_VISIBLE",       /* 10000000 */
    "WS_MINIMIZE",      /* 20000000 */
    "WS_CHILD",         /* 40000000 */
    "WS_POPUP",         /* 80000000 */
    0
};

static void print_rsrc_dialog_style(dword flags){
    int i;
    char buffer[1024];
    buffer[0] = 0;

    for (i=0;i<32;i++){
        if (flags & (1<<i)){
            strcat(buffer, ", ");
            strcat(buffer, rsrc_dialog_style[i]);
        }
    }
    printf("    Style: %s\n", buffer+2);
}

static const char *const rsrc_button_type[] = {
    "BS_PUSHBUTTON",        /* 0 */
    "BS_DEFPUSHBUTTON",     /* 1 */
    "BS_CHECKBOX",          /* 2 */
    "BS_AUTOCHECKBOX",      /* 3 */
    "BS_RADIOBUTTON",       /* 4 */
    "BS_3STATE",            /* 5 */
    "BS_AUTO3STATE",        /* 6 */
    "BS_GROUPBOX",          /* 7 */
    "BS_USERBUTTON",        /* 8 */
    "BS_AUTORADIOBUTTON",   /* 9 */
    "BS_PUSHBOX",           /* 10 */
    "BS_OWNERDRAW",         /* 11 */
    "(unknown type 12)",
    "(unknown type 13)",
    "(unknown type 14)",
    "(unknown type 15)",
    0
};

static const char *const rsrc_edit_style[] = {
    0, 0,       /* type */
    "ES_MULTILINE",   /* 0004 */
    "ES_UPPERCASE",   /* 0008 */
    "ES_LOWERCASE",   /* 0010 */
    "ES_PASSWORD",    /* 0020 */
    "ES_AUTOVSCROLL", /* 0040 */
    "ES_AUTOHSCROLL", /* 0080 */
    "ES_NOHIDESEL",   /* 0100 */
    "ES_COMBO",       /* 0200 */
    "ES_OEMCONVERT",  /* 0400 */
    "ES_READONLY",    /* 0800 */
    "ES_WANTRETURN",  /* 1000 */
    "ES_NUMBER",      /* 2000 */
    "(unknown flag 0x4000)",
    "(unknown flag 0x8000)",
    0
};

static const char *const rsrc_static_type[] = {
    "SS_LEFT",          /* 0 */
    "SS_CENTER",        /* 1 */
    "SS_RIGHT",         /* 2 */
    "SS_ICON",          /* 3 */
    "SS_BLACKRECT",     /* 4 */
    "SS_GRAYRECT",      /* 5 */
    "SS_WHITERECT",     /* 6 */
    "SS_BLACKFRAME",    /* 7 */
    "SS_GRAYFRAME",     /* 8 */
    "SS_WHITEFRAME",    /* 9 */
    "SS_USERITEM",      /* 10 */
    "SS_SIMPLE",        /* 11 */
    "SS_LEFTNOWORDWRAP",/* 12 */
    "SS_OWNERDRAW",     /* 13 */
    "SS_BITMAP",        /* 14 */
    "SS_ENHMETAFILE",   /* 15 */
    "SS_ETCHEDHORZ",    /* 16 */
    "SS_ETCHEDVERT",    /* 17 */
    "SS_ETCHEDFRAME",   /* 18 */
    0
};

static const char *const rsrc_static_style[] = {
    0, 0, 0, 0, 0, /* type */
    "(unknown flag 0x0020)",
    "SS_REALSIZECONTROL", /* 0040 */
    "SS_NOPREFIX",        /* 0080 */
    "SS_NOTIFY",          /* 0100 */
    "SS_CENTERIMAGE",     /* 0200 */
    "SS_RIGHTJUST",       /* 0400 */
    "SS_REALSIZEIMAGE",   /* 0800 */
    "SS_SUNKEN",          /* 1000 */
    "SS_EDITCONTROL",     /* 2000 */
    0
};

static const char *const rsrc_listbox_style[] = {
    "LBS_NOTIFY",            /* 0001 */
    "LBS_SORT",              /* 0002 */
    "LBS_NOREDRAW",          /* 0004 */
    "LBS_MULTIPLESEL",       /* 0008 */
    "LBS_OWNERDRAWFIXED",    /* 0010 */
    "LBS_OWNERDRAWVARIABLE", /* 0020 */
    "LBS_HASSTRINGS",        /* 0040 */
    "LBS_USETABSTOPS",       /* 0080 */
    "LBS_NOINTEGRALHEIGHT",  /* 0100 */
    "LBS_MULTICOLUMN",       /* 0200 */
    "LBS_WANTKEYBOARDINPUT", /* 0400 */
    "LBS_EXTENDEDSEL",       /* 0800 */
    "LBS_DISABLENOSCROLL",   /* 1000 */
    "LBS_NODATA",            /* 2000 */
    "LBS_NOSEL",             /* 4000 */
    "LBS_COMBOBOX",          /* 8000 */
    0
};

static const char *const rsrc_combobox_style[] = {
    0, 0, /* type */
    0, 0, /* unknown */
    "CBS_OWNERDRAWFIXED",    /* 0010 */
    "CBS_OWNERDRAWVARIABLE", /* 0020 */
    "CBS_AUTOHSCROLL",       /* 0040 */
    "CBS_OEMCONVERT",        /* 0080 */
    "CBS_SORT",              /* 0100 */
    "CBS_HASSTRINGS",        /* 0200 */
    "CBS_NOINTEGRALHEIGHT",  /* 0400 */
    "CBS_DISABLENOSCROLL",   /* 0800 */
    0, /* unknown */
    "CBS_UPPERCASE",         /* 2000 */
    "CBS_LOWERCASE",         /* 4000 */
    0
};

static void print_rsrc_control_style(byte class, dword flags){
    int i;
    char buffer[1024];
    buffer[0] = 0;

    printf("        Style: ");
    
    switch (class){
    case 0x80: /* Button */
        strcpy(buffer, rsrc_button_type[flags & 0x000f]);
        
        if (flags & 0x0010) strcat(buffer, ", (unknown flag 0x0010)");
        if (flags & 0x0020) strcat(buffer, ", BS_LEFTTEXT");

        if ((flags & 0x0040) == 0)
            strcat(buffer, ", BS_TEXT");
        else {
            if (flags & 0x0040) strcat(buffer, ", BS_ICON");
            if (flags & 0x0080) strcat(buffer, ", BS_BITMAP");
        }

        if      ((flags & 0x0300) == 0x0100) strcat(buffer, ", BS_LEFT");
        else if ((flags & 0x0300) == 0x0200) strcat(buffer, ", BS_RIGHT");
        else if ((flags & 0x0300) == 0x0300) strcat(buffer, ", BS_CENTER");

        if      ((flags & 0x0C00) == 0x0400) strcat(buffer, ", BS_TOP");
        else if ((flags & 0x0C00) == 0x0800) strcat(buffer, ", BS_BOTTOM");
        else if ((flags & 0x0C00) == 0x0C00) strcat(buffer, ", BS_VCENTER");

        if (flags & 0x1000) strcat(buffer, ", BS_PUSHLIKE");
        if (flags & 0x2000) strcat(buffer, ", BS_MULTILINE");
        if (flags & 0x4000) strcat(buffer, ", BS_NOTIFY");
        if (flags & 0x8000) strcat(buffer, ", BS_FLAT");

        break;

    case 0x81: /* Edit */
        if      ((flags & 3) == 0) strcpy(buffer, "ES_LEFT");
        else if ((flags & 3) == 1) strcpy(buffer, "ES_CENTER");
        else if ((flags & 3) == 2) strcpy(buffer, "ES_RIGHT");
        else if ((flags & 3) == 3) strcpy(buffer, "(unknown type 3)");

        for (i=2; i<16; i++){
            if (flags & (1<<i)){
                strcat(buffer, ", ");
                strcat(buffer, rsrc_edit_style[i]);
            }
        }
        break;
        
    case 0x82: /* Static */
        if ((flags & 0x001f) <= 0x12)
            strcpy(buffer, rsrc_static_type[flags & 0x001f]);
        else
            sprintf(buffer, "(unknown type %d)", flags & 0x001f);

        for (i=5; i<14; i++){
            if (flags & (1<<i)){
                strcat(buffer, ", ");
                strcat(buffer, rsrc_static_style[i]);
            }
        }
        break;

    case 0x83: /* ListBox */
        for (i=0; i<16; i++){
            if (flags & (1<<i)){
                strcat(buffer, ", ");
                strcat(buffer, rsrc_listbox_style[i]);
            }
        }
        break;

    case 0x84: /* ScrollBar */
        if (flags & 0x18){
            if (flags & 0x08)
                strcpy(buffer, "SBS_SIZEBOX");
            else if (flags & 0x10)
                strcpy(buffer, "SBS_SIZEGRIP");
            if (flags & 0x02)
                strcat(buffer, ", SBS_SIZEBOXTOPLEFTALIGN");
            if (flags & 0x04)
                strcat(buffer, ", SBS_SIZEBOXBOTTOMRIGHTALIGN");
        } else if (flags & 0x01){
            strcpy(buffer, "SBS_VERT");
            if (flags & 0x02)
                strcat(buffer, ", SBS_LEFTALIGN");
            if (flags & 0x04)
                strcat(buffer, ", SBS_RIGHTALIGN");
        } else {
            strcpy(buffer, "SBS_HORZ");
            if (flags & 0x02)
                strcat(buffer, ", SBS_TOPALIGN");
            if (flags & 0x04)
                strcat(buffer, ", SBS_BOTTOMALIGN");
        }
        if (flags & 0xffe0)
            sprintf(buffer+strlen(buffer), ", (unknown flags 0x%04x)", flags & 0xffe0);
        break;

    case 0x85: /* ComboBox */
        if ((flags & 3) == 1)
            strcat(buffer, ", CBS_SIMPLE");
        else if ((flags & 3) == 2)
            strcat(buffer, ", CBS_DROPDOWN");
        else if ((flags & 3) == 3)
            strcat(buffer, ", CBS_DROPDOWNLIST");
        
        for (i=4; i<15; i++){
            if ((flags & (1<<i)) && rsrc_combobox_style[i]){
                strcat(buffer, ", ");
                strcat(buffer, rsrc_combobox_style[i]);
            }
        }
        if (flags & 0x900c)
            sprintf(buffer+strlen(buffer), ", (unknown flags 0x%04x)", flags & 0x900c);
        break;

    default:
        sprintf(buffer, "0x%04x", flags & 0xffff);
    }

    /* and finally, WS_ flags */
    for (i=16; i<32; i++){
        if (flags & (1<<i)){
            strcat(buffer, ", ");
            strcat(buffer, rsrc_dialog_style[i]);
        }
    }

    printf("%s\n", (buffer[0] == ',') ? (buffer+2) : buffer);
}

struct dialog_control {
    word x;
    word y;
    word width;
    word height;
    word id;
    dword style;
    byte class;
};

static const char *const rsrc_dialog_class[] = {
    "Button",    /* 80 */
    "Edit",      /* 81 */
    "Static",    /* 82 */
    "ListBox",   /* 83 */
    "ScrollBar", /* 84 */
    "ComboBox",  /* 85 */
    0
};

static off_t print_rsrc_menu_items(int depth, off_t offset)
{
    word flags, id;
    char buffer[1024];
    int i;

    while (1) {
        flags = read_word(offset);
        offset += 2;

        printf("        ");
        for (i = 0; i < depth; i++) printf("  ");
        if (!(flags & 0x0010)) {
            /* item ID */
            id = read_word(offset);
            offset += 2;
            printf("%d: ", id);
        }

        offset = print_escaped_string0(offset);

        /* and print flags */
        buffer[0] = '\0';
        if (flags & 0x0001) strcat(buffer, ", grayed");
        if (flags & 0x0002) strcat(buffer, ", inactive");
        if (flags & 0x0004) strcat(buffer, ", bitmap");
        if (flags & 0x0008) strcat(buffer, ", checked");
        if (flags & 0x0010) strcat(buffer, ", popup");
        if (flags & 0x0020) strcat(buffer, ", menu bar break");
        if (flags & 0x0040) strcat(buffer, ", menu break");
        /* don't print ENDMENU */
        if (flags & 0xff00)
            sprintf(buffer+strlen(buffer), ", unknown flags 0x%04x", flags & 0xff00);
    
        if (buffer[0])
            printf(" (%s)", buffer+2);
        putchar('\n');

        /* if we have a popup, recurse */
        if (flags & 0x0010)
            offset = print_rsrc_menu_items(depth + 1, offset);

        if (flags & 0x0080)
            break;
    }

    return offset;
}

/* This is actually two headers, with the first (VS_VERSIONINFO)
 * describing the second. However it seems the second is always
 * a VS_FIXEDFILEINFO header, so we ignore most of those details. */
struct version_header {
    word length;            /* 00 */
    word value_length;      /* 02 - always 52 (0x34), the length of the second header */
    /* the "type" field given by Windows is missing */
    byte string[16];        /* 04 - the fixed string VS_VERSION_INFO\0 */
    dword magic;            /* 14 - 0xfeef04bd */
    word struct_2;          /* 18 - seems to always be 1.0 */
    word struct_1;          /* 1a */
    /* 1.2.3.4 &c. */
    word file_2;            /* 1c */
    word file_1;            /* 1e */
    word file_4;            /* 20 */
    word file_3;            /* 22 */
    word prod_2;            /* 24 - always the same as the above? */
    word prod_1;            /* 26 */
    word prod_4;            /* 28 */
    word prod_3;            /* 2a */
    dword flags_file_mask;  /* 2c - always 2 or 3f...? */
    dword flags_file;       /* 30 */
    dword flags_os;         /* 34 */
    dword flags_type;       /* 38 */
    dword flags_subtype;    /* 3c */
    dword date_1;           /* 40 - always 0? */
    dword date_2;           /* 44 */
};

STATIC_ASSERT(sizeof(struct version_header) == 0x48);

static const char *const rsrc_version_file[] = {
    "VS_FF_DEBUG",        /* 0001 */
    "VS_FF_PRERELEASE",   /* 0002 */
    "VS_FF_PATCHED",      /* 0004 */
    "VS_FF_PRIVATEBUILD", /* 0008 */
    "VS_FF_INFOINFERRED", /* 0010 */
    "VS_FF_SPECIALBUILD", /* 0020 */
    0
};

static const char *const rsrc_version_type[] = {
    "unknown",             /* 0 VFT_UNKNOWN */
    "application",         /* 1 VFT_APP */
    "DLL",                 /* 2 VFT_DLL */
    "device driver",       /* 3 VFT_DRV */
    "font",                /* 4 VFT_FONT */
    "virtual device",      /* 5 VFT_VXD */
    "(unknown type 6)",
    "static-link library", /* 7 VFT_STATIC_LIB */
    0
};

static const char *const rsrc_version_subtype_drv[] = {
    "unknown",              /* 0 VFT2_UNKNOWN */
    "printer",              /* 1 VFT2_DRV_PRINTER etc. */
    "keyboard",             /* 2 */
